load-tests/artillery/stress-test.yml
config:
  target: "http://localhost:3000"
  plugins:
    metrics-by-endpoint: {}
  
  # Stress test - gradually increase load until system breaks
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Phase 1: Light load"
    
    - duration: 60
      arrivalRate: 50
      name: "Phase 2: Moderate load"
    
    - duration: 60
      arrivalRate: 100
      name: "Phase 3: Heavy load"
    
    - duration: 60
      arrivalRate: 200
      name: "Phase 4: Extreme load"
    
    - duration: 60
      arrivalRate: 300
      name: "Phase 5: Breaking point"

  http:
    timeout: 30  # Increased timeout for stress testing
  
  ensure:
    maxErrorRate: 5  # Allow higher error rate for stress testing

scenarios:
  - name: "API Stress Test"
    weight: 100
    flow:
      - get:
          url: "/api/categories"
      
      - get:
          url: "/api/services"
      
      - get:
          url: "/api/services/search"
          qs:
            query: "service"
      
      - get:
          url: "/api/reviews/user/1/received"