load-tests/artillery/user-registration-test.yml
config:
  target: "http://localhost:3000"
  plugins:
    metrics-by-endpoint: {}
  
  phases:
    - duration: 30
      arrivalRate: 5
      name: "User Registration Test"

  http:
    timeout: 10

scenarios:
  - name: "User Registration Flow"
    weight: 100
    flow:
      - post:
          url: "/api/users/register"
          json:
            email: "loadtest{{ $randomNumber(10000, 99999) }}@example.com"
            password: "TestPass123!"
            firstName: "Load"
            lastName: "Test"
            phone: "+1{{ $randomNumber(1000000000, 9999999999) }}"  # Phone number format
          expect:
            - statusCode: [200, 201]  # Expecting successful creation
          capture:
            - json: "$.token"
              as: "authToken"
              
      - log: "Registration response captured, token: {{ authToken }}"